app/src/main/assets/soap/request_bipro440-kunde.xml

<soapenv:Envelope xmlns:nam="http://www.bipro.net/namespace"
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
${soapHeader}
    <soapenv:Body>
        <nam:getLinks>
            <nam:Request Version="1.4.1.0">
                <nam:Extranetsuche>
                    <nam:Partnersuche>
                        <nam:PartnernummerVu>${partnernummerVu}</nam:PartnernummerVu>
                        <nam:Name>${name}</nam:Name>
                        <nam:Vorname>${vorname}</nam:Vorname>
                        <nam:Strasse>${strasse}</nam:Strasse>
                        <nam:Postleitzahl>${plz}</nam:Postleitzahl>
                        <nam:Ort>${ort}</nam:Ort>
                    </nam:Partnersuche>
                </nam:Extranetsuche>
            </nam:Request>
        </nam:getLinks>
    </soapenv:Body>
</soapenv:Envelope>